<?php

$array_regions_en = array (
    "000" => "All regions",
    "001" => "001 * Moscow and the Moscow region",
    "002" => "002 * St. Petersburg and the Leningrad Region",
);

$array_regions = array (
    "000" => "Все регионы",
    "101" => "101 * МИЦ (TEPS-MAIN)",
    "102" => "102 * Дополнительная ТП (Шаболовка)",
    "001" => "001 * ОПФР по Республике Адыгея",
    "002" => "002 * ОПФР по Республике Башкортостан",
    "003" => "003 * ОПФР по Республике Бурятия",
    "004" => "004 * ОПФР по Республике Алтай",
    "005" => "005 * ОПФР по Кабардино-Балкарской Республике",
    "006" => "006 * ОПФР по Республике Калмыкия",
    "007" => "007 * ОПФР по Республике Коми",
    "008" => "008 * ОПФР по Карачаево-Черкесской Республике",
    "009" => "009 * ОПФР по Республике Карелия",
    "010" => "010 * ОПФР по Республике Марий Эл",
    "011" => "011 * ОПФР по Республике Мордовия",
    "012" => "012 * ОПФР по Республике Северная Осетия - Алания",
    "013" => "013 * ОПФР по Республике Татарстан",
    "014" => "014 * ОПФР по Республике Хакасия",
    "015" => "015 * ОПФР по Чувашской Республике",
    "016" => "016 * ОПФР по Республике Саха",
    "017" => "017 * ОПФР по Республике Дагестан",
    "018" => "018 * ОПФР по Республике Тыва",
    "019" => "019 * ОПФР по Удмуртской Республике",
    "020" => "020 * ОПФР по Чеченской Республике",
    "024" => "024 * ОПФР по Ненецкому автономному округу",
    "027" => "027 * ОПФР по Ханты-Мансийскому автономному округу",
    "028" => "028 * ОПФР по Чукотскому автономному округу",
    "030" => "030 * ОПФР по Ямало-Ненецкому автономному округу",
    "031" => "031 * ОПФР по Еврейской автономной области",
    "032" => "032 * ОПФР по Алтайскому краю",
    "033" => "033 * ОПФР по Краснодарскому краю",
    "035" => "035 * ОПФР по Приморскому краю",
    "036" => "036 * ОПФР по Ставропольскому краю",
    "037" => "037 * ОПФР по Хабаровскому краю",
    "038" => "038 * ОПФР по Амурской области",
    "039" => "039 * ОПФР по Архангельской области",
    "040" => "040 * ОПФР по Астраханской области",
    "041" => "041 * ОПФР по Белгородской области",
    "042" => "042 * ОПФР по Брянской области",
    "043" => "043 * ОПФР по Владимирской области",
    "044" => "044 * ОПФР по Волгоградской области",
    "045" => "045 * ОПФР по Вологодской области",
    "046" => "046 * ОПФР по Воронежской области",
    "047" => "047 * ОПФР по Ивановской области",
    "048" => "048 * ОПФР по Иркутской области",
    "049" => "049 * ОПФР по Калининградской области",
    "050" => "050 * ОПФР по Калужской области",
    "052" => "052 * ОПФР по Кемеровской области",
    "053" => "053 * ОПФР по Кировской области",
    "054" => "054 * ОПФР по Костромской области",
    "055" => "055 * ОПФР по Курганской области",
    "056" => "056 * ОПФР по Курской области",
    "057" => "057 * ОПФР по Санкт-Петербургу и Ленинградской области (ЛО)",
    "058" => "058 * ОПФР по Липецкой области",
    "059" => "059 * ОПФР по Магаданской области",
    "060" => "060 * ОПФР по Москве и Московской области (МО)",
    "061" => "061 * ОПФР по Мурманской области",
    "062" => "062 * ОПФР по Нижегородской области",
    "063" => "063 * ОПФР по Новгородской области",
    "064" => "064 * ОПФР по Новосибирской области",
    "065" => "065 * ОПФР по Омской области",
    "066" => "066 * ОПФР по Оренбургской области",
    "067" => "067 * ОПФР по Орловской области",
    "068" => "068 * ОПФР по Пензенской области",
    "070" => "070 * ОПФР по Псковской области",
    "071" => "071 * ОПФР по Ростовской области",
    "072" => "072 * ОПФР по Рязанской области",
    "073" => "073 * ОПФР по Саратовской области",
    "074" => "074 * ОПФР по Сахалинской области",
    "075" => "075 * ОПФР по Свердловской области",
    "076" => "076 * ОПФР по Смоленской области",
    "077" => "077 * ОПФР по Самарской области",
    "078" => "078 * ОПФР по Тверской области",
    "079" => "079 * ОПФР по Тамбовской области",
    "080" => "080 * ОПФР по Томской области",
    "081" => "081 * ОПФР по Тульской области",
    "082" => "082 * ОПФР по Тюменской области",
    "083" => "083 * ОПФР по Ульяновской области",
    "084" => "084 * ОПФР по Челябинской области",
    "086" => "086 * ОПФР по Ярославской области",
    "087" => "087 * ОПФР по Москве и Московской области (г. Москва)",
    "088" => "088 * ОПФР по Санкт-Петербургу и Ленинградской области (г. Санкт-Петербург)",
    "089" => "089 * ОПФР по Республике Ингушетия",
    "090" => "090 * ОПФР по г. Байконур",
    "091" => "091 * ОПФР по Республике Крым",
    "092" => "092 * ОПФР по г. Севастополь",
    "201" => "201 * ОПФР по Москве и Московской области",
    "202" => "202 * ОПФР по Санкт-Петербургу и Ленинградской обл.",
    "203" => "203 * ОПФР по Пермскому краю",
    "205" => "205 * ОПФР по Красноярскому краю",
    "206" => "206 * ОПФР по Камчатскому краю",
    "207" => "207 * ОПФР по Забайкальскому краю"
);

// **************************************************************************************************************************************************

$array_exeptions = array (
    "tems-main" => array ("PFR_ID_TORG" => "101",
        "PFR_OBJECTSERVER" => "NCOMS",
        "root_password" => "passw0rd",
        "sysadmin_password" => "passw0rdt1vol1",
        "HUB" => "TEMS",
    ),
    "ITM013" => array ("PFR_ID_TORG" => "013",
        "PFR_OBJECTSERVER" => "NCO013",
        "root_password" => "passw0rd",
        "sysadmin_password" => "passw0rdt1vol1",
        "HUB" => "HUB013",
    ),
    "ITM032" => array ("PFR_ID_TORG" => "032",
        "PFR_OBJECTSERVER" => "NCO032",
        "root_password" => "passw0rd",
        "sysadmin_password" => "passw0rdt1vol1",
        "HUB" => "HUB032",
    ),
    "ITM087" => array ("PFR_ID_TORG" => "201",
        "PFR_OBJECTSERVER" => "NCO087",
        "root_password" => "passw0rdt1vol1",
        "sysadmin_password" => "passw0rdt1vol1",
        "HUB" => "HUB087",
    ),
    "ITM102" => array ("PFR_ID_TORG" => "102",
        "PFR_OBJECTSERVER" => "NCO102",
        "root_password" => "passw0rd",
        "sysadmin_password" => "passw0rdt1vol1",
        "HUB" => "HUB102",
    ),
    "ITM205" => array ("PFR_ID_TORG" => "205",
        "PFR_OBJECTSERVER" => "NCO205",
        "root_password" => "passw0rd",
        "sysadmin_password" => "passw0rdt1vol1",
        "HUB" => "HUB205",
    ),
);

// **************************************************************************************************************************************************

function pfr_id_fo ($pfr_id_torg)
{
    switch ($pfr_id_torg) {
        case "001":
            return "03";
            break;
        case "002":
            return "04";
            break;
        case "003":
            return "06";
            break;
        case "004":
            return "06";
            break;
        case "005":
            return "09";
            break;
        case "006":
            return "03";
            break;
        case "007":
            return "02";
            break;
        case "008":
            return "09";
            break;
        case "009":
            return "02";
            break;
        case "010":
            return "04";
            break;
        case "011":
            return "04";
            break;
        case "012":
            return "09";
            break;
        case "013":
            return "04";
            break;
        case "014":
            return "06";
            break;
        case "015":
            return "04";
            break;
        case "016":
            return "07";
            break;
        case "017":
            return "09";
            break;
        case "018":
            return "06";
            break;
        case "019":
            return "04";
            break;
        case "020":
            return "09";
            break;
        case "024":
            return "02";
            break;
        case "027":
            return "05";
            break;
        case "028":
            return "07";
            break;
        case "030":
            return "05";
            break;
        case "031":
            return "07";
            break;
        case "032":
            return "06";
            break;
        case "033":
            return "03";
            break;
        case "035":
            return "07";
            break;
        case "036":
            return "09";
            break;
        case "037":
            return "07";
            break;
        case "038":
            return "07";
            break;
        case "039":
            return "02";
            break;
        case "040":
            return "03";
            break;
        case "041":
            return "01";
            break;
        case "042":
            return "01";
            break;
        case "043":
            return "01";
            break;
        case "044":
            return "03";
            break;
        case "045":
            return "02";
            break;
        case "046":
            return "01";
            break;
        case "047":
            return "01";
            break;
        case "048":
            return "06";
            break;
        case "049":
            return "02";
            break;
        case "050":
            return "01";
            break;
        case "052":
            return "06";
            break;
        case "053":
            return "04";
            break;
        case "054":
            return "01";
            break;
        case "055":
            return "05";
            break;
        case "056":
            return "01";
            break;
        case "058":
            return "01";
            break;
        case "059":
            return "07";
            break;
        case "060":
            return "01";
            break;
        case "061":
            return "02";
            break;
        case "062":
            return "04";
            break;
        case "063":
            return "02";
            break;
        case "064":
            return "06";
            break;
        case "065":
            return "06";
            break;
        case "066":
            return "04";
            break;
        case "067":
            return "01";
            break;
        case "068":
            return "04";
            break;
        case "070":
            return "02";
            break;
        case "071":
            return "03";
            break;
        case "072":
            return "01";
            break;
        case "073":
            return "04";
            break;
        case "074":
            return "07";
            break;
        case "075":
            return "05";
            break;
        case "076":
            return "01";
            break;
        case "077":
            return "04";
            break;
        case "078":
            return "01";
            break;
        case "079":
            return "01";
            break;
        case "080":
            return "06";
            break;
        case "081":
            return "01";
            break;
        case "082":
            return "05";
            break;
        case "083":
            return "04";
            break;
        case "084":
            return "05";
            break;
        case "086":
            return "01";
            break;
        case "087":
            return "01";
            break;
        case "089":
            return "09";
            break;
        case "090":
            return "08";
            break;
        case "091":
            return "03";
            break;
        case "092":
            return "03";
            break;
        case "101":
            return "01";
            break;
        case "102":
            return "01";
            break;
        case "201":
            return "01";
            break;
        case "202":
            return "02";
            break;
        case "203":
            return "04";
            break;
        case "205":
            return "06";
            break;
        case "206":
            return "07";
            break;
        case "207":
            return "06";
            break;
        default:
            return "";
            break;
    }
}

// **************************************************************************************************************************************************

function pfr_fo ($pfr_id_fo)
{
    switch ($pfr_id_fo) {
        case "01":
            return "Центральный федеральный округ";
            break;
        case "02":
            return "Северо-Западный федеральный округ";
            break;
        case "03":
            return "Южный федеральный округ";
            break;
        case "04":
            return "Приволжский федеральный округ";
            break;
        case "05":
            return "Уральский федеральный округ";
            break;
        case "06":
            return "Сибирский федеральный округ";
            break;
        case "07":
            return "Дальневосточный федеральный округ";
            break;
        case "08":
            return "Прямое подчинение";
            break;
        case "09":
            return "Северо-Кавказский федеральный округ";
            break;
        default:
            return "";
            break;
    }
}

// **************************************************************************************************************************************************

$array_HUBs = array (
	'001' => '10.1.0.217',
	'002' => '10.2.0.207',
	'003' => '10.3.0.18',
	'004' => '10.4.0.169',
	'005' => '10.5.30.3',
	'006' => '10.6.0.12',
	'007' => '10.7.0.92',
	'008' => '10.8.0.88',
	'009' => '10.9.1.190',
	'010' => '10.10.0.251',
	'011' => '10.11.36.111',
	'012' => '10.12.0.209',
	'013' => '10.13.0.16',
	'014' => '10.49.232.14',
	'015' => '10.15.0.243',
	'016' => '10.16.0.74',
	'017' => '10.17.0.59',
	'018' => '10.18.0.41',
	'019' => '10.19.4.250',
	'020' => '10.20.0.51',
	'024' => '10.24.0.71',
	'027' => '10.27.0.199',
	'028' => '10.28.0.98',
	'030' => '10.30.0.60',
	'031' => '10.31.0.29',
	'032' => '10.32.99.178',
	'033' => '10.33.0.30',
	'035' => '10.35.0.107',
	'036' => '10.36.100.235',
	'037' => '10.37.0.88',
	'038' => '10.38.0.114',
	'039' => '10.39.0.80',
	'040' => '10.40.0.28',
	'041' => '10.41.31.22',
	'042' => '10.42.0.251',
	'043' => '10.43.1.210',
	'044' => '10.44.1.163',
	'045' => '10.45.0.173',
	'046' => '10.46.0.99',
	'047' => '10.47.0.130',
	'048' => '10.48.0.200',
	'049' => '10.49.3.124',
	'050' => '10.50.0.163',
	'052' => '10.52.201.52',
	'053' => '10.53.53.119',
	'054' => '10.54.0.95',
	'055' => '10.55.0.231',
	'056' => '10.56.0.93',
	'058' => '10.58.0.86',
	'059' => '10.59.59.60',
	'061' => '10.61.0.213',
	'062' => '10.62.0.176',
	'063' => '10.63.0.65',
	'064' => '10.64.250.50',
	'065' => '10.65.0.126',
	'066' => '10.66.2.47',
	'067' => '10.67.0.198',
	'068' => '10.68.0.200',
	'070' => '10.70.0.93',
	'071' => '10.71.100.131',
	'072' => '10.72.0.70',
	'073' => '10.73.0.230',
	'074' => '10.74.0.54',
	'075' => '10.75.232.16',
	'076' => '10.76.0.252',
	'077' => '10.77.10.181',
	'078' => '10.78.1.250',
	'079' => '10.79.24.1',
	'080' => '10.80.0.1',
	'081' => '10.81.0.79',
	'082' => '10.82.0.6',
	'083' => '10.83.0.218',
	'084' => '10.84.0.95',
	'086' => '10.86.0.35',
	'089' => '10.89.0.193',
	'090' => '10.90.1.250',
	'091' => '10.91.0.75 ',
	'101' => '10.103.0.61',
	'102' => '10.102.0.183',
	'201' => '10.87.0.170',
	'202' => '10.57.255.57',
	'203' => '10.69.169.199',
	'205' => '10.34.0.135',
	'206' => '10.51.0.110',
	'207' => '10.85.0.201',
	);

?>
